Config/Documents/ПлановыеПоступленияОплатыРодительскаяПлата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПлановыеПоступленияОплатыРодительскаяПлата</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеДатыОплатыРодительскойПлаты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскаяПлатаДопУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетЗаНесколькоМесяцев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДетскогоУчреждения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДетскогоУчреждения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчетовПоРодительскойПлате</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дети</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АвтоРасчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аннуляция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаДетскогоУчреждения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыДетскогоУчреждения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ребенок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиОплатыОбразование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготыСтудентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПосещенияПоГрафику</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПосещенияКОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоДоговору</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Comment>Идентификатор строки - для связи с документов "Квитанция на оплату"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ПлательщикиПоУслугамДДУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлательщикиПоУслугамДДУ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПлательщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ребенок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/ПлановыеПоступленияОплатыРодительскаяПлата/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТаблицаОплат.Ссылка.Дата КАК Период,
	|	ТаблицаОплат.Ребенок КАК Ребенок,
	|	ТаблицаОплат.ГруппаДетскогоУчреждения КАК ГруппаДетскогоУчреждения,
	|	ТаблицаОплат.ДатаОплаты,
	|	ТаблицаОплат.Сумма КАК Сумма,
	|	ТаблицаОплат.ДоговорКонтрагента,
	|	ТаблицаОплат.ДнейПосещенияПоГрафику,
	|	ТаблицаОплат.ДнейПосещенияКОплате,
	|	ТаблицаОплат.КонецПериода КАК КонецПериода,
	|	ТаблицаОплат.Льгота,
	|	ТаблицаОплат.НачалоПериода КАК НачалоПериода,
	|	ТаблицаОплат.СтавкаОплаты,
	|	ТаблицаОплат.СуммаПоДоговору,
	|	ТаблицаОплат.ГруппаДетскогоУчреждения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаОплат.Ссылка.РодительскаяПлатаДопУслуги,
	|	ТаблицаОплат.Аннуляция
	|ИЗ
	|	Документ.ПлановыеПоступленияОплатыРодительскаяПлата.Дети КАК ТаблицаОплат
	|ГДЕ
	|	ТаблицаОплат.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ПлановыеДатыОплатыРодительскойПлаты", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// Заполняет таблицу списком детей, рассчитывет плановые суммы поступлений для выписки квитанций
//
Функция ЗаполнитьИРассчитатьСуммыПоступленийРодительскойПлаты(ДатаНач, ДатаКон, Знач ГруппаДДУ, РодительскаяПлатаДопУслуги = 0) Экспорт
	
	Если РодительскаяПлатаДопУслуги = 0 Тогда
		ТаблицаОплат = РодительскаяПлата.СоставитьСписокДетейГруппыОсновнойОбразовательнойПрограммы(ДатаНач, , ГруппаДДУ, Истина);
	ИначеЕсли РодительскаяПлатаДопУслуги = 1 Тогда
		ТаблицаОплат = РодительскаяПлата.СоставитьСписокДетейГруппыДополнительнойОбразовательнойПрограммы(ДатаНач, , ГруппаДДУ, Истина);
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив);
	ТаблицаОплат.Колонки.Добавить("ДнейПосещенияПоГрафику", ОписаниеТиповЧ);
	ТаблицаОплат.Колонки.Добавить("ДнейПосещенияКОплате", ОписаниеТиповЧ);
    ТаблицаОплат.Колонки.Добавить("СуммаПоДоговору", ОписаниеТиповЧ);
    ТаблицаОплат.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
    	
	// считаем, что посещать будут весь период
	ТаблицаОплат.ЗаполнитьЗначения(ДатаКон, "КонецПериода");
	
	// определяем количество рабочих дней в рассчитываемом периоде
	КалендарныйГрафикГруппы = РасчетыПоРодительскойПлате.ПолучитьКалендарныйГрафикГруппы(ГруппаДДУ,ДатаНач);
	КоличествоДней = РодительскаяПлата.ПолучитьКоличествоРабочихДнейПоКалендарю(ДатаНач, ДатаКон, 
													?(ТипЗнч(ГруппаДДУ) = Тип("СправочникСсылка.ГруппыДетскогоУчреждения"), КалендарныйГрафикГруппы, Неопределено));
			
	ТаблицаОплат.ЗаполнитьЗначения(КоличествоДней, "ДнейПосещенияПоГрафику,ДнейПосещенияКОплате"); 
	
	РодительскаяПлата.ЗаполнитьКоличествоДнейПосещений(ДатаНач, ДатаКон, ТаблицаОплат, РодительскаяПлатаДопУслуги,
													?(ТипЗнч(ГруппаДДУ) = Тип("СправочникСсылка.ГруппыДетскогоУчреждения"), КалендарныйГрафикГруппы, Неопределено));
	
	Для Каждого Стр Из ТаблицаОплат Цикл
		
		Стр.СуммаПоДоговору = РодительскаяПлатаКлиентСервер.ПолучитьСуммуОплаты(Стр.СтавкаОплаты, Стр.ДнейПосещенияПоГрафику, Стр.ДнейПосещенияКОплате, Стр.НачалоПериода, Стр.КонецПериода, Стр.Льгота);
		Стр.Сумма 			= Стр.СуммаПоДоговору + Стр.Задолженность;	

	КонецЦикла;
	
	Возврат ТаблицаОплат;
	
КонецФункции

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ПлановыеПоступленияОплатыРодительскаяПлата";
	КомандаПечати.Идентификатор = "ПФ_MXL_ВедомостьРасчетаРП";
	КомандаПечати.Представление = Нстр("ru='Ведомость расчета родительской платы'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ВедомостьРасчетаРП") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных формы
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ВедомостьРасчетаРП",
			"Ведомость расчета родительской платы",
			ПечатьВедомости(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры // Печать

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьВедомости(МассивОбъектов, ОбъектыПечати)
	
	Ссылка = МассивОбъектов[0];
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВедомостьРасчетаРП";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПлановыеПоступленияОплатыРодительскаяПлата.ПФ_MXL_ВедомостьРасчетаРП");
	
	ДанныеДляПечати = ПодготовитьДанныеДляПечати(Ссылка);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Если НЕ ЗначениеЗаполнено(Ссылка.ГруппаДетскогоУчреждения) Тогда
		Область.УдалитьОбласть(Область.Область("ШапкаГруппа"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	Область.Параметры.Заполнить(ДанныеДляПечати.Шапка);
	
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");
	Если ЗначениеЗаполнено(Ссылка.ГруппаДетскогоУчреждения) Тогда
		Область.УдалитьОбласть(Область.Область("СтрокаГруппа"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	Для Каждого Стр Из ДанныеДляПечати.ТаблицаСтрок Цикл
		Область.Параметры.Заполнить(Стр);
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Итого");
	Область.Параметры.Заполнить(ДанныеДляПечати.Итоги);
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Подписи");
	Область.Параметры.Заполнить(ДанныеДляПечати.Подписи);
	ТабДок.Вывести(Область);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 1, ОбъектыПечати, МассивОбъектов[0]);
	
	Возврат ТабДок;
	
КонецФункции

Функция ПодготовитьДанныеДляПечати(Ссылка)
	
	ДанныеДляПечати = Новый Структура;
	
	Шапка = Новый Структура;
	Шапка.Вставить("Период", Формат(Ссылка.НачалоПериода, "ДФ='ММММ гггг ""г.""'")); 
	Шапка.Вставить("Дата", Ссылка.Дата);
	Шапка.Вставить("Организация", ?(Ссылка.Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование, Ссылка.Организация.НаименованиеСокращенное, Ссылка.Организация.НаименованиеПолное));
	Шапка.Вставить("КодПоОКПО", Ссылка.Организация.КодОКПО);
	Шапка.Вставить("ГруппаДДУ", Ссылка.ГруппаДетскогоУчреждения);
	Шапка.Вставить("РабочихДнейВМесяце", РодительскаяПлата.ПолучитьКоличествоРабочихДнейПоКалендарю(Ссылка.НачалоПериода, Ссылка.КонецПериода));
	Шапка.Вставить("НачалоПериода", Формат(Ссылка.НачалоПериода, "ДЛФ=D"));
	
	ДанныеДляПечати.Вставить("Шапка", Шапка);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.НомерСтроки КАК Нпп,
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.ГруппаДетскогоУчреждения КАК ГруппаДДУ,
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.Ребенок КАК Ребенок,
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.ДоговорКонтрагента КАК Договор,
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.ДнейПосещенияПоГрафику КАК ДнейПоГрафику,
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.ДнейПосещенияКОплате КАК ДнейКОплате,
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.СуммаПоДоговору КАК СуммаПоДоговору,
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.Льгота КАК Льгота,
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.Сумма КАК СуммаКОплате,
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.Задолженность КАК Долг,
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.ДатаОплаты КАК ДатаОплаты,
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.СтавкаОплаты КАК Ставка,
	|	Плательщики.Плательщик КАК Плательщик
	|ИЗ
	|	Документ.ПлановыеПоступленияОплатыРодительскаяПлата.Дети КАК ПлановыеПоступленияОплатыРодительскаяПлатаДети
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлательщикиПоУслугамДДУ.СрезПоследних(&НаДату, ) КАК Плательщики
	|		ПО ПлановыеПоступленияОплатыРодительскаяПлатаДети.Ребенок = Плательщики.Ребенок
	|ГДЕ
	|	ПлановыеПоступленияОплатыРодительскаяПлатаДети.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Нпп";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НаДату", Ссылка.НачалоПериода);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаСтрок = Запрос.Выполнить().Выгрузить();
	
	ДанныеДляПечати.Вставить("ТаблицаСтрок", ТаблицаСтрок);
	
	Итоги = Новый Структура;
	Итоги.Вставить("ДнейПоГрафику", ТаблицаСтрок.Итог("ДнейПоГрафику"));
	Итоги.Вставить("ДнейКОплате", ТаблицаСтрок.Итог("ДнейКОплате"));
	Итоги.Вставить("СуммаПоДоговору", ТаблицаСтрок.Итог("СуммаПоДоговору"));
	Итоги.Вставить("Долг", ТаблицаСтрок.Итог("Долг"));
	Итоги.Вставить("СуммаКОплате", ТаблицаСтрок.Итог("СуммаКОплате"));
	
	ДанныеДляПечати.Вставить("Итоги", Итоги);
	
	ОтветственныеЛица = ОрганизационнаяСтруктураПовтИсп.ОтветственныеЛицаОрганизацииСоответствием(Ссылка.Организация,
		Ссылка.Дата, Ссылка.Подразделение);
	Руководитель = КорреспондентыКлиентСервер.ФИО(ОтветственныеЛица.Получить("Руководитель").ОтветственноеЛицоФИО, Истина);
	ГлБухгалтер = КорреспондентыКлиентСервер.ФИО(ОтветственныеЛица.Получить("Главный бухгалтер").ОтветственноеЛицоФИО, Истина);
	
	Подписи = Новый Структура;
	Подписи.Вставить("Дата", Ссылка.Дата);
	Подписи.Вставить("Руководитель", Руководитель);
	Подписи.Вставить("ГлБухгалтер", ГлБухгалтер);
	
	ДанныеДляПечати.Вставить("Подписи", Подписи);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

#КонецОбласти

#КонецЕсли
